import { Box, Flex, Heading } from "@chakra-ui/react";

import type { VFC } from "react";

export const TermsPageView: VFC = () => {
  return (
    <main>
      <Flex direction="column" gridGap={12} py={24} px={96}>
        <Heading as="h1" size="2xl">
          huriuri利用規約
        </Heading>
        <Box>
          <Heading mb={"2"} as="h2" size="lg">
            第１条
          </Heading>
          <Flex direction="column" gridGap={8}>
            <Box>
              この利用規約（以下「本規約」といいます）は、株式会社インパクトブルー（以下「当社」といいます）が提供する「Foods
              Route」（インターネット上における独立・開業支援情報関連サービスサイトおよびこのサイトに付随するメールサービスなどの各種情報提供サービス、その他支援サービスの総称。以下「本サービス」といいます）の利用条件を定めるものです。会員登録をした皆さま（以下「会員」といいます）には、本規約に従って本サービスをご利用いただきます。
            </Box>
            <Box>
              この利用規約（以下「本規約」といいます）は、株式会社インパクトブルー（以下「当社」といいます）が提供する「Foods
              Route」（インターネット上における独立・開業支援情報関連サービスサイトおよびこのサイトに付随するメールサービスなどの各種情報提供サービス、その他支援サービスの総称。以下「本サービス」といいます）の利用条件を定めるものです。会員登録をした皆さま（以下「会員」といいます）には、本規約に従って本サービスをご利用いただきます。
            </Box>
          </Flex>
        </Box>
        <Box>
          <Heading mb={"2"} as="h2" size="lg">
            第１条
          </Heading>
          <Flex direction="column" gridGap={4}>
            <Box>
              この利用規約（以下「本規約」といいます）は、株式会社インパクトブルー（以下「当社」といいます）が提供する「Foods
              Route」（インターネット上における独立・開業支援情報関連サービスサイトおよびこのサイトに付随するメールサービスなどの各種情報提供サービス、その他支援サービスの総称。以下「本サービス」といいます）の利用条件を定めるものです。会員登録をした皆さま（以下「会員」といいます）には、本規約に従って本サービスをご利用いただきます。
            </Box>
            <Box>
              この利用規約（以下「本規約」といいます）は、株式会社インパクトブルー（以下「当社」といいます）が提供する「Foods
              Route」（インターネット上における独立・開業支援情報関連サービスサイトおよびこのサイトに付随するメールサービスなどの各種情報提供サービス、その他支援サービスの総称。以下「本サービス」といいます）の利用条件を定めるものです。会員登録をした皆さま（以下「会員」といいます）には、本規約に従って本サービスをご利用いただきます。
            </Box>
          </Flex>
        </Box>
        <Box>
          <Heading mb={"2"} as="h2" size="lg">
            第１条
          </Heading>
          <Flex direction="column" gridGap={4}>
            <Box>
              この利用規約（以下「本規約」といいます）は、株式会社インパクトブルー（以下「当社」といいます）が提供する「Foods
              Route」（インターネット上における独立・開業支援情報関連サービスサイトおよびこのサイトに付随するメールサービスなどの各種情報提供サービス、その他支援サービスの総称。以下「本サービス」といいます）の利用条件を定めるものです。会員登録をした皆さま（以下「会員」といいます）には、本規約に従って本サービスをご利用いただきます。
            </Box>
            <Box>
              この利用規約（以下「本規約」といいます）は、株式会社インパクトブルー（以下「当社」といいます）が提供する「Foods
              Route」（インターネット上における独立・開業支援情報関連サービスサイトおよびこのサイトに付随するメールサービスなどの各種情報提供サービス、その他支援サービスの総称。以下「本サービス」といいます）の利用条件を定めるものです。会員登録をした皆さま（以下「会員」といいます）には、本規約に従って本サービスをご利用いただきます。
            </Box>
          </Flex>
        </Box>
      </Flex>
    </main>
  );
};
